
#Область Служебные

Процедура ЗаполнитьПредставления()
	
	Если ЭтоГруппа Тогда
		Возврат;	
	КонецЕсли;
	
	СтрокаПользователи = кзоСлужебные.ПолучитьПредставлениеПользователейИГрупп(ЭтотОбъект);
	
	СтрокаПравила = "";
	СтрокаПравила = "";
		
	Настройки = ХранилищеНастроек.Получить();
	
	Если Настройки <> Неопределено 
		И Настройки.Свойство("НастройкиОтбора")
		Тогда
		СтрокаОтбор = кзоСКД.СформироватьПредставлениеПоОтбору(Настройки.НастройкиОтбора);
	КонецЕсли;
	
	Если Настройки <> Неопределено 
		И Настройки.Свойство("НастройкиПроверки")
		Тогда
		СтрокаПравила = кзоСКД.СформироватьПредставлениеПоОтбору(Настройки.НастройкиПроверки);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.кзоПравилаЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Активно, НачалоПериода, КонецПериода, ОбъектМетаданных, ХранилищеНастроек");
		
		Основание = ДанныеЗаполнения;
		Пользователи.Загрузить(ДанныеЗаполнения.Пользователи.Выгрузить());
		ГруппыПользователей.Загрузить(ДанныеЗаполнения.ГруппыПользователей.Выгрузить());
		
		Наименование = Справочники.кзоПравилаПроверкиЗаполнения.СформироватьНаименование(ЭтотОбъект);		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ЗаполнитьПредставления();
	
КонецПроцедуры

#КонецОбласти
