
#Область Служебные

Процедура ЗаполнитьПредставления()
	
	Если ЭтоГруппа Тогда
		Возврат;	
	КонецЕсли;
	
	// СтрокаОтбор
	Настройки = ХранилищеНастроек.Получить();
	Если Настройки = Неопределено
		ИЛИ НЕ Настройки.Свойство("НастройкиОтбора")
		ИЛИ ВидСобытия = Перечисления.кзоВидыСобытийПравилЗаполнения.СозданиеНового
		Тогда
		СтрокаОтбор = "";		
	Иначе
		СтрокаОтбор = кзоСКД.СформироватьПредставлениеПоОтбору(Настройки.НастройкиОтбора);		
	КонецЕсли;
	
	// СтрокаПользователи
	СтрокаПользователи = кзоСлужебные.ПолучитьПредставлениеПользователейИГрупп(ЭтотОбъект);
		
	// СтрокаПравила
	Массив = Новый Массив;
	Для каждого Строка Из Заполнение Цикл
		Если НЕ Строка.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Текст = СтрШаблон("%1 = %2", Строка.ИмяРеквизита, Строка.Значение);		
		Массив.Добавить(Текст);
	КонецЦикла;
	
	Массив = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Массив);
	СтрокаПравила = СтрСоединить(Массив, ", ");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	ЗаполнитьПредставления();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

#КонецОбласти
